test_log.log
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 1
Report intermediate results every 1 second(s)
Random number generator seed is 0 and will be ignored


Initializing worker threads...

Threads started!

[   1s] thds: 1 tps: 39.00 qps: 790.93 (r/w/o: 555.95/155.99/78.99) lat (ms,99%): 29.09 err/s: 0.00 reconn/s:  0.00
[   2s] thds: 1 tps: 41.00 qps: 815.01 (r/w/o: 569.01/164.00/82.00) lat (ms,99%): 36.50 err/s: 0.00 reconn/s:  0.00
[   3s] thds: 1 tps: 42.00 qps: 850.00 (r/w/o: 597.00/169.00/84.00) lat (ms,99%): 28.64 err/s: 0.00 reconn/s:  0.00
[   4s] thds: 1 tps: 45.00 qps: 891.00 (r/w/o: 622.00/179.00/90.00) lat (ms,99%): 26.29 err/s: 0.00 reconn/s:  0.00
[   5s] thds: 1 tps: 45.00 qps: 901.95 (r/w/o: 631.97/179.99/90.00) lat (ms,99%): 26.11 err/s: 0.00 reconn/s:  0.00
[   6s] thds: 1 tps: 43.00 qps: 854.03 (r/w/o: 596.02/172.01/86.00) lat (ms,99%): 30.92 err/s: 0.00 reconn/s:  0.00
[   7s] thds: 1 tps: 44.00 qps: 878.01 (r/w/o: 614.00/176.00/88.00) lat (ms,99%): 28.36 err/s: 0.00 reconn/s:  0.00
[   8s] thds: 1 tps: 46.00 qps: 927.01 (r/w/o: 651.00/184.00/92.00) lat (ms,99%): 27.06 err/s: 0.00 reconn/s:  0.00
[   9s] thds: 1 tps: 46.00 qps: 919.02 (r/w/o: 643.01/184.00/92.00) lat (ms,99%): 27.73 err/s: 0.00 reconn/s:  0.00
[  10s] thds: 1 tps: 44.00 qps: 889.97 (r/w/o: 623.98/177.99/88.00) lat (ms,99%): 30.78 err/s: 0.00 reconn/s:  0.00
OLTP test statistics:
    queries performed:
        read:                            6104
        write:                           1744
        other:                           872
        total:                           8720
    transactions:                        436    (43.58 per sec.)
    read/write requests:                 7848   (784.51 per sec.)
    other operations:                    872    (87.17 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0037s
    total number of events:              436
    total time taken by event execution: 10.0015s
    response time:
         min:                                 19.04ms
         avg:                                 22.94ms
         max:                                 36.50ms
         approx.  99 percentile:              29.09ms

Threads fairness:
    events (avg/stddev):           436.0000/0.00
    execution time (avg/stddev):   10.0015/0.00